<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Cloudflare WARP for teams from the Cloudflare AppCenter feed. This release is intended for organizations using WARP for Teams and is typically newer than the public 1.1.1.1 release.</string>
        <key>Identifier</key>
        <string>com.github.vaxa-tech.download.Cloudflare-WARP</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Cloudflare WARP</string>
            <key>SPARKLE_FEED_URL</key>
            <string>https://api.appcenter.ms/v0.1/public/sparkle/apps/87d9992a-351c-44a9-849b-3f9a89d63d18</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>SparkleUpdateInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>appcast_url</key>
                    <string>%SPARKLE_FEED_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%.pkg</string>
                    <key>url</key>
                    <string>%url%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>comment</key>
                    <string>Use wildcard matching for the app so it will also match FirefoxDeveloperEdition.app and FirefoxNightly.app</string>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.cloudflare.1dot1dot1dot1.macos" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68WVV388M8")</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>